{
  "global_settings": {
    "coupling": 70,
    "speed": 100
  },
  "nodes": [
    {
      "id": 0,
      "class_name": "ReflexiveFieldNode",
      "pos_x": 155.0,
      "pos_y": 67.0,
      "width": 695.0,
      "height": 353.0,
      "config": {
        "inputs": {
          "field_state": "image",
          "external_spectrum": "spectrum",
          "awareness": "signal",
          "freeze_model": "signal",
          "reset": "signal"
        },
        "outputs": {
          "reflexive_field": "image",
          "prediction_field": "image",
          "error_field": "image",
          "self_model": "image",
          "prediction_error": "signal",
          "integration": "signal",
          "parameter_drift": "signal",
          "complexity": "signal",
          "autonomy": "signal",
          "model_spectrum": "spectrum"
        },
        "node_title": "Base Node",
        "size": 64,
        "model_dim": 16,
        "field_gain": 1.426407274910188,
        "field_smooth": 0.1,
        "prediction_weight": 0.3,
        "model_learning_rate": 0.001,
        "modulation_rate": 0.0001,
        "total_prediction_error": 0.000867480353945803,
        "integration_measure": 0.9946856764645362,
        "autonomy_measure": 1.0,
        "t": 23132
      },
      "custom_state_file": "reflexive_model_0.npz"
    },
    {
      "id": 1,
      "class_name": "EphapticFieldNode2",
      "pos_x": -101.0,
      "pos_y": 34.0,
      "width": 200.0,
      "height": 180.0,
      "config": {
        "inputs": {
          "mode_spectrum": "spectrum",
          "band_spectrum": "spectrum",
          "full_spectrum": "spectrum",
          "complex_modes": "complex_spectrum",
          "source_image": "image",
          "learning_rate": "signal",
          "field_strength": "signal",
          "threshold_mod": "signal",
          "coupling_mod": "signal",
          "reset": "signal",
          "freeze": "signal"
        },
        "outputs": {
          "ephaptic_field": "image",
          "thought_field": "image",
          "weight_map": "image",
          "spike_map": "image",
          "potential_map": "image",
          "gradient_field": "image",
          "combined_view": "image",
          "field_fft": "image",
          "firing_rate": "signal",
          "synchrony": "signal",
          "field_energy": "signal",
          "field_stability": "signal",
          "learning_delta": "signal",
          "complexity": "signal",
          "autonomy": "signal",
          "dominant_mode": "signal",
          "eigenfrequencies": "spectrum",
          "field_spectrum": "spectrum"
        },
        "node_title": "Base Node",
        "size": 128,
        "center": 64,
        "input_mode": "mode_spectrum",
        "use_source_image": false,
        "plateau_duration": 10,
        "plateau_boost": 0.3,
        "n_long_range": 512,
        "threshold": 0.7,
        "refractory_period": 5,
        "leak": 0.08,
        "coupling": 0.2,
        "input_gain": 0.5,
        "field_tau": 0.95,
        "field_coupling": 0.15,
        "field_diffusion": 0.3,
        "base_learning_rate": 0.01,
        "weight_decay": 0.001,
        "long_range_strength": 0.3,
        "projection_mode": "radial",
        "temporal_modulation": true,
        "phase_coupling": true,
        "max_history": 50,
        "t": 23132
      },
      "custom_state_file": "ephaptic_state_1.npz"
    },
    {
      "id": 2,
      "class_name": "TemporalBlurNode",
      "pos_x": 1371.0,
      "pos_y": 97.0,
      "width": 430.0,
      "height": 455.0,
      "config": {
        "inputs": {
          "image_in": "image",
          "reset": "signal"
        },
        "outputs": {
          "image_out": "image"
        },
        "node_title": "Temporal Blur (Ghosting)",
        "feedback": 0.9
      },
      "custom_state_file": null
    },
    {
      "id": 3,
      "class_name": "EphapticFieldNode2",
      "pos_x": 925.0,
      "pos_y": 198.0,
      "width": 223.0,
      "height": 279.0,
      "config": {
        "inputs": {
          "mode_spectrum": "spectrum",
          "band_spectrum": "spectrum",
          "full_spectrum": "spectrum",
          "complex_modes": "complex_spectrum",
          "source_image": "image",
          "learning_rate": "signal",
          "field_strength": "signal",
          "threshold_mod": "signal",
          "coupling_mod": "signal",
          "reset": "signal",
          "freeze": "signal"
        },
        "outputs": {
          "ephaptic_field": "image",
          "thought_field": "image",
          "weight_map": "image",
          "spike_map": "image",
          "potential_map": "image",
          "gradient_field": "image",
          "combined_view": "image",
          "field_fft": "image",
          "firing_rate": "signal",
          "synchrony": "signal",
          "field_energy": "signal",
          "field_stability": "signal",
          "learning_delta": "signal",
          "complexity": "signal",
          "autonomy": "signal",
          "dominant_mode": "signal",
          "eigenfrequencies": "spectrum",
          "field_spectrum": "spectrum"
        },
        "node_title": "Base Node",
        "size": 128,
        "center": 64,
        "input_mode": "mode_spectrum",
        "use_source_image": false,
        "plateau_duration": 10,
        "plateau_boost": 0.3,
        "n_long_range": 512,
        "threshold": 0.05,
        "refractory_period": 0.8,
        "leak": 0.08,
        "coupling": 10,
        "input_gain": 2,
        "field_tau": 0.005,
        "field_coupling": 5,
        "field_diffusion": 0.3,
        "base_learning_rate": 0.01,
        "weight_decay": 0.001,
        "long_range_strength": 5,
        "projection_mode": "radial",
        "temporal_modulation": true,
        "phase_coupling": true,
        "max_history": 50,
        "t": 8602
      },
      "custom_state_file": "ephaptic_state_3.npz"
    },
    {
      "id": 4,
      "class_name": "SourceLocalizationNode",
      "pos_x": -399.0,
      "pos_y": 49.0,
      "width": 219.0,
      "height": 186.0,
      "config": {
        "inputs": {
          "gain_mod": "signal",
          "speed_mod": "signal"
        },
        "outputs": {
          "source_image": "image",
          "eigenmode_image": "image",
          "lh_image": "image",
          "rh_image": "image",
          "mode_spectrum": "spectrum",
          "complex_modes": "complex_spectrum",
          "band_spectrum": "spectrum",
          "full_spectrum": "spectrum",
          "mode_1": "signal",
          "mode_2": "signal",
          "mode_3": "signal",
          "mode_4": "signal",
          "mode_5": "signal",
          "mode_6": "signal",
          "mode_7": "signal",
          "mode_8": "signal",
          "mode_9": "signal",
          "mode_10": "signal",
          "delta_power": "signal",
          "theta_power": "signal",
          "alpha_power": "signal",
          "beta_power": "signal",
          "gamma_power": "signal",
          "raw_source": "signal",
          "dominant_mode": "signal"
        },
        "input_data": {
          "gain_mod": [],
          "speed_mod": []
        },
        "node_title": "Base Node",
        "edf_path": "E:\\docshouse\\450\\1.edf",
        "source_spacing": "oct5",
        "inverse_method": "sLORETA",
        "n_eigenmodes": 20,
        "n_output_modes": 10,
        "time_window": 0.5,
        "amplification": 1000000,
        "bands": {
          "delta": [
            1,
            4
          ],
          "theta": [
            4,
            8
          ],
          "alpha": [
            8,
            13
          ],
          "beta": [
            13,
            30
          ],
          "gamma": [
            30,
            45
          ]
        },
        "is_loaded": true,
        "is_initialized": true,
        "load_error": "",
        "n_lh_vertices": 1026,
        "n_rh_vertices": 1026,
        "fs": 100.0,
        "playback_idx": 550,
        "frame_count": 412,
        "_loading": false,
        "_last_path": "E:\\docshouse\\450\\1.edf"
      },
      "custom_state_file": null
    }
  ],
  "edges": [
    {
      "from_node_id": 1,
      "from_port": "thought_field",
      "to_node_id": 0,
      "to_port": "field_state",
      "learned_weight": 1.0
    },
    {
      "from_node_id": 0,
      "from_port": "model_spectrum",
      "to_node_id": 3,
      "to_port": "mode_spectrum",
      "learned_weight": 1.0
    },
    {
      "from_node_id": 3,
      "from_port": "gradient_field",
      "to_node_id": 2,
      "to_port": "image_in",
      "learned_weight": 1.0
    },
    {
      "from_node_id": 4,
      "from_port": "complex_modes",
      "to_node_id": 1,
      "to_port": "complex_modes",
      "learned_weight": 1.0
    },
    {
      "from_node_id": 4,
      "from_port": "mode_spectrum",
      "to_node_id": 1,
      "to_port": "mode_spectrum",
      "learned_weight": 1.0
    },
    {
      "from_node_id": 4,
      "from_port": "band_spectrum",
      "to_node_id": 1,
      "to_port": "full_spectrum",
      "learned_weight": 1.0
    },
    {
      "from_node_id": 4,
      "from_port": "full_spectrum",
      "to_node_id": 1,
      "to_port": "band_spectrum",
      "learned_weight": 1.0
    }
  ]
}