{
  "global_settings": {
    "coupling": 100,
    "speed": 100
  },
  "nodes": [
    {
      "id": 0,
      "class_name": "EphapticFieldNode2",
      "pos_x": 741.0,
      "pos_y": 462.0,
      "width": 260.0,
      "height": 182.0,
      "config": {
        "inputs": {
          "mode_spectrum": "spectrum",
          "band_spectrum": "spectrum",
          "full_spectrum": "spectrum",
          "complex_modes": "complex_spectrum",
          "source_image": "image",
          "learning_rate": "signal",
          "field_strength": "signal",
          "threshold_mod": "signal",
          "coupling_mod": "signal",
          "reset": "signal",
          "freeze": "signal"
        },
        "outputs": {
          "ephaptic_field": "image",
          "thought_field": "image",
          "weight_map": "image",
          "spike_map": "image",
          "potential_map": "image",
          "gradient_field": "image",
          "combined_view": "image",
          "field_fft": "image",
          "firing_rate": "signal",
          "synchrony": "signal",
          "field_energy": "signal",
          "field_stability": "signal",
          "learning_delta": "signal",
          "complexity": "signal",
          "autonomy": "signal",
          "dominant_mode": "signal",
          "eigenfrequencies": "spectrum",
          "field_spectrum": "spectrum"
        },
        "node_title": "Base Node",
        "size": 128,
        "center": 64,
        "input_mode": "complex_modes",
        "use_source_image": false,
        "plateau_duration": 0.1,
        "plateau_boost": 0.0005,
        "n_long_range": 512,
        "threshold": 1e-17,
        "refractory_period": 1e-18,
        "leak": 0.01,
        "coupling": 0.001,
        "input_gain": 10,
        "field_tau": 5e-06,
        "field_coupling": 30,
        "field_diffusion": 180,
        "base_learning_rate": 0.5,
        "weight_decay": 0.05,
        "long_range_strength": 0,
        "projection_mode": "radial",
        "temporal_modulation": true,
        "phase_coupling": true,
        "max_history": 50,
        "t": 60805
      },
      "custom_state_file": "ephaptic_state_0.npz"
    },
    {
      "id": 1,
      "class_name": "RadialIntegrationNode",
      "pos_x": 519.0,
      "pos_y": 6.0,
      "width": 675.0,
      "height": 430.0,
      "config": {
        "inputs": {
          "chaos_field": "image",
          "phase_field": "image",
          "integration_strength": "signal",
          "wave_speed": "signal",
          "resonance_q": "signal",
          "center_x": "signal",
          "center_y": "signal",
          "reset": "signal"
        },
        "outputs": {
          "qualia_point": "signal",
          "qualia_region": "image",
          "radial_profile": "spectrum",
          "standing_wave": "image",
          "collapsed_field": "image",
          "resonance_spectrum": "spectrum",
          "binding_map": "image",
          "phase_coherence_radial": "spectrum",
          "traveling_wave": "image",
          "combined_view": "image",
          "peak_radius": "signal",
          "center_energy": "signal",
          "integration_completeness": "signal",
          "dominant_ring": "signal"
        },
        "node_title": "Base Node",
        "size": 128,
        "center": 64,
        "n_rings": 64,
        "qualia_point": 0.3486088232453284,
        "peak_radius": 15.0,
        "center_energy": 34.74677775754222,
        "base_integration": 0.3,
        "base_wave_speed": 2.0,
        "base_resonance_q": 5.0,
        "damping": 0.95,
        "phase_coupling": 0.5,
        "resonance_radii": [
          13,
          14,
          30,
          31
        ],
        "t": 5871
      },
      "custom_state_file": null
    },
    {
      "id": 2,
      "class_name": "SourceLocalizationNode",
      "pos_x": 243.0,
      "pos_y": 50.0,
      "width": 200.0,
      "height": 180.0,
      "config": {
        "inputs": {
          "gain_mod": "signal",
          "speed_mod": "signal"
        },
        "outputs": {
          "source_image": "image",
          "eigenmode_image": "image",
          "lh_image": "image",
          "rh_image": "image",
          "mode_spectrum": "spectrum",
          "complex_modes": "complex_spectrum",
          "band_spectrum": "spectrum",
          "full_spectrum": "spectrum",
          "mode_1": "signal",
          "mode_2": "signal",
          "mode_3": "signal",
          "mode_4": "signal",
          "mode_5": "signal",
          "mode_6": "signal",
          "mode_7": "signal",
          "mode_8": "signal",
          "mode_9": "signal",
          "mode_10": "signal",
          "delta_power": "signal",
          "theta_power": "signal",
          "alpha_power": "signal",
          "beta_power": "signal",
          "gamma_power": "signal",
          "raw_source": "signal",
          "dominant_mode": "signal"
        },
        "input_data": {
          "gain_mod": [],
          "speed_mod": []
        },
        "node_title": "Base Node",
        "edf_path": "e:\\docshouse\\450\\2.edf",
        "source_spacing": "oct5",
        "inverse_method": "sLORETA",
        "n_eigenmodes": 20,
        "n_output_modes": 10,
        "time_window": 0.5,
        "amplification": 1000000,
        "bands": {
          "delta": [
            1,
            4
          ],
          "theta": [
            4,
            8
          ],
          "alpha": [
            8,
            13
          ],
          "beta": [
            13,
            30
          ],
          "gamma": [
            30,
            45
          ]
        },
        "is_loaded": true,
        "is_initialized": true,
        "load_error": "",
        "n_lh_vertices": 1026,
        "n_rh_vertices": 1026,
        "fs": 100.0,
        "playback_idx": 8150,
        "frame_count": 4346,
        "_loading": false,
        "_last_path": "e:\\docshouse\\450\\2.edf"
      },
      "custom_state_file": null
    },
    {
      "id": 3,
      "class_name": "CabbageScannerNode",
      "pos_x": 1301.0,
      "pos_y": 78.0,
      "width": 383.0,
      "height": 401.0,
      "config": {
        "inputs": {
          "target_image": "image"
        },
        "outputs": {
          "dna_55": "spectrum",
          "reconstruction": "image",
          "error": "signal"
        },
        "node_title": "Cabbage Scanner",
        "resolution": 128,
        "max_n": 5,
        "max_m": 5
      },
      "custom_state_file": null
    },
    {
      "id": 4,
      "class_name": "GlobeToEquirectangularNode",
      "pos_x": 1749.0,
      "pos_y": 57.0,
      "width": 479.0,
      "height": 473.0,
      "config": {
        "inputs": {
          "image_in": "image"
        },
        "outputs": {
          "image_out": "image"
        },
        "node_title": "Globe Unwrapper (360)",
        "spin_x": 0.0,
        "spin_y": 0.0,
        "output_w": 512,
        "output_h": 256,
        "center_x": 0.5,
        "center_y": 0.5,
        "radius_scale": 1.0
      },
      "custom_state_file": null
    }
  ],
  "edges": [
    {
      "from_node_id": 0,
      "from_port": "thought_field",
      "to_node_id": 1,
      "to_port": "phase_field",
      "learned_weight": 1.0
    },
    {
      "from_node_id": 0,
      "from_port": "gradient_field",
      "to_node_id": 1,
      "to_port": "chaos_field",
      "learned_weight": 1.0
    },
    {
      "from_node_id": 1,
      "from_port": "qualia_point",
      "to_node_id": 0,
      "to_port": "threshold_mod",
      "learned_weight": 1.0
    },
    {
      "from_node_id": 2,
      "from_port": "mode_spectrum",
      "to_node_id": 0,
      "to_port": "mode_spectrum",
      "learned_weight": 1.0
    },
    {
      "from_node_id": 2,
      "from_port": "band_spectrum",
      "to_node_id": 0,
      "to_port": "band_spectrum",
      "learned_weight": 1.0
    },
    {
      "from_node_id": 2,
      "from_port": "complex_modes",
      "to_node_id": 0,
      "to_port": "complex_modes",
      "learned_weight": 1.0
    },
    {
      "from_node_id": 1,
      "from_port": "binding_map",
      "to_node_id": 3,
      "to_port": "target_image",
      "learned_weight": 1.0
    },
    {
      "from_node_id": 3,
      "from_port": "reconstruction",
      "to_node_id": 4,
      "to_port": "image_in",
      "learned_weight": 1.0
    }
  ]
}